---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.WidthParameterError
source: html/3797028d-4955-c2ef-b39a-f8bb1631822a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.WidthParameterError Property

This is used to post error.The "External Diameter" parameter must be set to a strictly positive value.

## Syntax (C#)
```csharp
public static FailureDefinitionId WidthParameterError { get; }
```